import React from "react";
import { GoalSection, GoalContainer, GoalHeadline, GoalParagraph } from "./Goal.styled";
const Goal = () => {
    return (
        <>
            <GoalSection>
                <GoalContainer>
                    <GoalHeadline>Наша місія</GoalHeadline>
                    <GoalParagraph>Наша місія — забезпечити Україну доступною та чистою енергією, сприяючи сталому розвитку через інноваційні рішення в галузі сонячної енергетики. Ми прагнемо зробити енергетичну незалежність реальністю для кожного дому та бізнесу, використовуючи потужність сонця для забезпечення світлого майбутнього.</GoalParagraph>
                    <GoalHeadline>Наша візія</GoalHeadline>
                    <GoalParagraph>Ми бачимо Україну лідером у впровадженні відновлювальних джерел енергії, де сонячна енергія забезпечує економічну стабільність, екологічну чистоту та сталий розвиток. Ми прагнемо створити енергетичну революцію, яка забезпечить енергетичну незалежність країни і покращить якість життя для кожного громадянина.</GoalParagraph>

                </GoalContainer>
            </GoalSection>

        </>
    )
};

export { Goal };