import React from "react";

import { ServicesSection, ServicesContainer, ServicesOption, ServicesHead, ServicesParagraph } from "./Services.styled";

const Services = () => {
    return (
        <>
            <ServicesSection>
                <ServicesContainer>
                    <ServicesHead>Ми пропонуємо повний цикл послуг:</ServicesHead>
                    <ul>
                        <li>
                            <ServicesOption> Проєктування: </ServicesOption>
                            <ServicesParagraph>На етапі проєктування ми ретельно аналізуємо потреби наших клієнтів, враховуючи особливості місцевості, кліматичні умови та технічні вимоги. Наші фахівці використовують сучасні програмні засоби для створення детальних планів, які забезпечують оптимальну ефективність роботи майбутньої сонячної електростанції. Ми гарантуємо, що всі рішення відповідають міжнародним стандартам якості та вимогам екологічної безпеки.</ServicesParagraph></li>
                        <li>
                            <ServicesOption>
                                Будівництво:
                            </ServicesOption>
                            <ServicesParagraph>Реалізація проєктів включає підготовку майданчика, монтаж сонячних панелей, інверторів, систем кріплення та інших компонентів. Ми використовуємо лише високоякісні матеріали та обладнання від перевірених постачальників, що забезпечує тривалий термін служби та надійність системи. Усі етапи будівництва виконуються в суворій відповідності до технічних специфікацій, графіків і бюджету. Наш підхід «під ключ» означає, що клієнт отримує готову до експлуатації електростанцію, яка починає генерувати енергію одразу після запуску.
                            </ServicesParagraph>
                        </li>
                        <li>
                            <ServicesOption>
                                Експлуатація та обслуговування:
                            </ServicesOption>
                            <ServicesParagraph>
                                Ми забезпечуємо постійний моніторинг роботи електростанцій, використовуючи сучасні системи діагностики. Регулярне технічне обслуговування включає перевірку та очищення сонячних панелей, діагностику обладнання, оновлення програмного забезпечення та усунення можливих несправностей. Наші послуги з експлуатації спрямовані на підтримку стабільної роботи електростанції, максимізацію її продуктивності та зниження експлуатаційних витрат.</ServicesParagraph>
                        </li>
                    </ul>
                </ServicesContainer>
            </ServicesSection>
        </>
    )
};

export { Services };